Number Property
 The number.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public string Number { get; set; }
  Visual Basic
Public Property Number As String
	Get
	Set
  Visual C++
public:
property String^ Number {
	String^ get ();
	void set (String^ value);
}
 See Also
  SpatialElement Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →